## Importing the dataset and Data

In [2]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd


test = pd.read_csv("./test.csv")
train = pd.read_csv("./train.csv")

# Replace 'Survived' to the last column
# Replace 'Name' to the first column <- to delete
train = train[['Name', 'PassengerId', 'Pclass', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived']]
# train으로만 하고 test에 예측값을 넣어서 라벨 달아서 제출하면 정답률이 

test = test[['Name', 'PassengerId', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked']]

X = train.iloc[:, 1:-1].values
y = train.iloc[:,-1].values

print(X)
print(y)

# shape 확인
# print(train.shape)
# print(test.shape)

[[1 3 'male' ... 7.25 nan 'S']
 [2 1 'female' ... 71.2833 'C85' 'C']
 [3 3 'female' ... 7.925 nan 'S']
 ...
 [889 3 'female' ... 23.45 nan 'S']
 [890 1 'male' ... 30.0 'C148' 'C']
 [891 3 'male' ... 7.75 nan 'Q']]
[0 1 1 1 0 0 0 0 1 1 1 1 0 0 0 1 0 1 0 1 0 1 1 1 0 1 0 0 1 0 0 1 1 0 0 0 1
 0 0 1 0 0 0 1 1 0 0 1 0 0 0 0 1 1 0 1 1 0 1 0 0 1 0 0 0 1 1 0 1 0 0 0 0 0
 1 0 0 0 1 1 0 1 1 0 1 1 0 0 1 0 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 1 1 0 1 0
 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 1 1 0 0 0 0 1 0 0 1 0 0 0 0 1 1 0 0 0 1 0
 0 0 0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 1 1 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 1 1
 0 1 1 0 0 1 0 1 1 1 1 0 0 1 0 0 0 0 0 1 0 0 1 1 1 0 1 0 0 0 1 1 0 1 0 1 0
 0 0 1 0 1 0 0 0 1 0 0 1 0 0 0 1 0 0 0 1 0 0 0 0 0 1 1 0 0 0 0 0 0 1 1 1 1
 1 0 1 0 0 0 0 0 1 1 1 0 1 1 0 1 1 0 0 0 1 0 0 0 1 0 0 1 0 1 1 1 1 0 0 0 0
 0 0 1 1 1 1 0 1 0 1 1 1 0 1 1 1 0 0 0 1 1 0 1 1 0 0 1 1 0 1 0 1 1 1 1 0 0
 0 1 0 0 1 1 0 1 1 0 0 0 1 1 1 1 0 0 0 0 0 0 0 1 0 1 1 0 0 0 0 0 0 1 1 1 1
 1 0 0 0 0 1 1 0 0 0 1 1 0 1 0 0 0 1 0 1 1 1 0 1 1 0 0 0 0 1 1 0 0 0 0 0 0
 1 0 0 0 0 1 0 1 0 1 1 0 0 0 0 0 0 0 0 1 1 0 1 1 1 1 0 0 1 0 1 0 0 1 0 0 1
 1 1 1 1 1 1 0 0 0 1 0 1 0 1 1 0 1 0 0 0 0 0 0 0 0 1 0 0 1 1 0 0 0 0 0 1 0
 0 0 1 1 0 1 0 0 1 0 0 0 0 0 0 1 0 0 0 0 0 0 0 1 0 1 1 0 1 1 0 1 1 0 0 1 0
 1 0 1 0 0 1 0 0 1 0 0 0 1 0 0 1 0 1 0 1 0 1 1 0 0 1 0 0 1 1 0 1 1 0 0 1 1
 0 1 0 1 1 0 0 0 0 0 0 0 0 0 1 1 1 1 1 0 0 1 1 0 1 1 1 0 0 0 1 0 1 0 0 0 1
 0 0 0 0 1 0 0 1 1 0 0 0 1 0 0 1 1 1 0 0 1 0 0 1 0 0 1 0 0 1 1 0 0 0 0 1 0
 0 1 0 1 0 0 1 0 0 0 0 0 1 0 1 1 1 0 1 0 1 0 1 0 1 0 0 0 0 0 0 1 0 0 0 1 0
 0 0 0 1 1 0 0 1 0 0 0 1 0 1 0 1 0 0 0 0 0 0 0 1 1 1 1 0 0 0 0 1 0 0 1 1 0
 0 0 0 1 1 1 1 1 0 1 0 0 0 1 1 0 0 1 0 0 0 1 0 1 1 0 0 1 0 0 0 0 0 0 1 0 0
 1 0 1 0 1 0 0 1 0 0 1 1 0 0 1 1 0 0 0 1 0 0 1 1 0 1 0 0 0 0 0 0 0 0 1 0 0
 1 0 1 1 1 0 0 0 0 1 0 1 0 0 0 0 0 0 0 1 1 0 0 0 1 1 1 1 0 0 0 0 1 0 0 0 0
 0 0 0 0 0 0 1 1 0 1 0 0 0 1 1 1 1 1 0 0 0 1 0 0 1 1 0 0 1 0 0 0 0 0 0 1 0
 0 0 1 0 1 1 1 1 0 0 0 1 0 0 1 1 0 0 1 0 1 0 0 1 1 0 0 0 1 1 0 0 0 0 0 0 1
 0 1 0]

In [3]:
# train set 칼럼 확인
print(train.columns)
# test set 칼럼 확인
print(test.columns)
# train 정보 확인
print(train.info())

Index(['Name', 'PassengerId', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')
Index(['Name', 'PassengerId', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         891 non-null    object
 1   PassengerId  891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
 11  Survived     891 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [4]:
# 상관계수 분석 
# 상관분석 correlation analysis
# 상관관계 correlation coeffiecient
train.corr()

C:\Users\이나라\AppData\Local\Temp\ipykernel_21384\1457380320.py:4: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  train.corr()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Survived
PassengerId,1.000000,-0.035144,0.036847,-0.057527,-0.001652,0.012658,-0.005007
Pclass,-0.035144,1.000000,-0.369226,0.083081,0.018443,-0.549500,-0.338481
Age,0.036847,-0.369226,1.000000,-0.308247,-0.189119,0.096067,-0.077221
SibSp,-0.057527,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.035322
Parch,-0.001652,0.018443,-0.189119,0.414838,1.000000,0.216225,0.081629
Fare,0.012658,-0.549500,0.096067,0.159651,0.216225,1.000000,0.257307
Survived,-0.005007,-0.338481,-0.077221,-0.035322,0.081629,0.257307,1.000000

## Data Preprocessing

In [5]:
# Replace 'Sex'
train['Sex'] = train['Sex'].replace('male',0)
test['Sex'] = test['Sex'].replace('male',0)
train['Sex'] = train['Sex'].replace('female',1)
test['Sex'] = test['Sex'].replace('female',1)

In [6]:
train.head(3)

,Name,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Braund, Mr. Owen Harris",1,3,0,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",2,1,1,38.0,1,0,PC 17599,71.2833,C85,C,1
2,"Heikkinen, Miss. Laina",3,3,1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1

## Missing Data + Encoding categorical data

In [7]:
# 널값 어디에 얼마나 있는지 확인하기
train.isnull().sum()
# missing data in 'Age', 'Cabin', 'Embarked'

Name             0
PassengerId      0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Survived         0
dtype: int64

In [8]:
# dropna function은 NaN value 존재하는 행 또는 열 제거
# subset 명시하지 않으면 전체, 명시하면 적힌 column값에 대해서만 dropna 진행
# Embarked 
train2 = train.dropna(subset = ['Embarked'])
test2 = test.dropna(subset = ['Embarked'])

In [9]:
print(train2.shape)

(889, 12)

In [10]:
train2.head(1)

,Name,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Braund, Mr. Owen Harris",1,3,0,22.0,1,0,A/5 21171,7.25,NaN,S,0

In [11]:
train2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         889 non-null    object
 1   PassengerId  889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Sex          889 non-null    int64
 4   Age          712 non-null    float64
 5   SibSp        889 non-null    int64
 6   Parch        889 non-null    int64
 7   Ticket       889 non-null    object
 8   Fare         889 non-null    float64
 9   Cabin        202 non-null    object
 10  Embarked     889 non-null    object
 11  Survived     889 non-null    int64
dtypes: float64(2), int64(6), object(4)
memory usage: 90.3+ KB

In [12]:
train[train['Embarked'].isnull()]

,Name,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
61,"Icard, Miss. Amelie",62,1,1,38.0,0,0,113572,80.0,B28,NaN,1
829,"Stone, Mrs. George Nelson (Martha Evelyn)",830,1,1,62.0,0,0,113572,80.0,B28,NaN,1

In [13]:
train[train['Fare'] == 80.0]

,Name,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
61,"Icard, Miss. Amelie",62,1,1,38.0,0,0,113572,80.0,B28,NaN,1
829,"Stone, Mrs. George Nelson (Martha Evelyn)",830,1,1,62.0,0,0,113572,80.0,B28,NaN,1

In [14]:
# train 에서 Pclass가 1인 'Embarked' 값 개수 찾아내
train[train['Pclass'] == 1]['Embarked'].value_counts()

S    127
C     85
Q      2
Name: Embarked, dtype: int64

In [15]:
# train 에서 Survived가 1인 'Embarked' 값 개수 찾아내
train[train['Survived'] == 1]['Embarked'].value_counts()

S    217
C     93
Q     30
Name: Embarked, dtype: int64

In [16]:
# train 'Embarked' 값 개수 찾아내
train['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [17]:
train['Embarked'] = train['Embarked'].fillna("S")
test['Embarked'] = test['Embarked'].fillna("S")

In [18]:
train.isnull().sum()

Name             0
PassengerId      0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
Survived         0
dtype: int64

In [19]:
a = train['Name'].str.contains('Miss\.')
# b = train['Name'].str.contains('Mr\.')
c = train['Name'].str.contains('Mrs\.')
d = train['Name'].str.contains('Master\.')
e = train['Name'].str.contains('Dr\.')

In [20]:
miss_age = train[a]['Age'].mean().__round__(1)
# mr_age = train[b]['Age'].mean().__round__(1)
mrs_age = train[c]['Age'].mean().__round__(1)
master_age = train[d]['Age'].mean().__round__(1)
dr_age = train[e]['Age'].mean().__round__(1)

In [21]:
mr_t1 = train.loc[(train['Age'] >= 30) & train['Name'].str.contains('Mr\.') ]
mr_t2 = train.loc[(train['Age'] < 30) & train['Name'].str.contains('Mr\.') ]
mr_t3 = train.loc[(train['Fare'] >= 10.5) & train['Name'].str.contains('Mr\.') & train['Age'].notnull() ]
mr_t4 = train.loc[(train['Fare'] < 10.5) & train['Name'].str.contains('Mr\.') & train['Age'].notnull() ]

mr_t5 =  mr_t3['Age'].mean()

mr_t6 =  mr_t4['Age'].mean()

print(mr_t5 , mr_t6)

35.4828431372549 29.09278350515464

In [22]:
train.loc[train['Name'].str.contains('Miss\.'), 'Age'] = train[train['Name'].str.contains('Miss\.')]['Age'].fillna(miss_age)
# train.loc[train['Name'].str.contains('Mr\.'), 'Age'] = train[train['Name'].str.contains('Mr\.')]['Age'].fillna(mr_age)
train.loc[train['Name'].str.contains('Mrs\.'), 'Age'] = train[train['Name'].str.contains('Mrs\.')]['Age'].fillna(mrs_age)
train.loc[train['Name'].str.contains('Master\.'), 'Age'] = train[train['Name'].str.contains('Master\.')]['Age'].fillna(master_age)
train.loc[(train['Name'].str.contains('Mr\.')) & train['Fare'] >= 10.5 , 'Age'] = train.loc[(train['Name'].str.contains('Mr\.')) & train['Fare'] >= 10.5 , 'Age'].fillna(mr_t5)
train.loc[(train['Name'].str.contains('Mr\.')) & train['Fare'] < 10.5 , 'Age'] = train.loc[(train['Name'].str.contains('Mr\.')) & train['Fare'] < 10.5 , 'Age'].fillna(mr_t6)
train.loc[train['Name'].str.contains('Dr\.'), 'Age'] = train[train['Name'].str.contains('Dr\.')]['Age'].fillna(mr_t5)

In [23]:
test.loc[test['Name'].str.contains('Miss\.'), 'Age'] = test[test['Name'].str.contains('Miss\.')]['Age'].fillna(miss_age)
# test.loc[test['Name'].str.contains('Mr\.'), 'Age'] = test[test['Name'].str.contains('Mr\.')]['Age'].fillna(mr_age)
test.loc[test['Name'].str.contains('Mrs\.'), 'Age'] = test[test['Name'].str.contains('Mrs\.')]['Age'].fillna(mrs_age)
test.loc[test['Name'].str.contains('Master\.'), 'Age'] = test[test['Name'].str.contains('Master\.')]['Age'].fillna(master_age)
test.loc[(test['Name'].str.contains('Mr\.')) & test['Fare'] >= 10.5 , 'Age'] = test.loc[(test['Name'].str.contains('Mr\.')) & test['Fare'] >= 10.5 , 'Age'].fillna(mr_t5)
test.loc[(test['Name'].str.contains('Mr\.')) & test['Fare'] < 10.5 , 'Age'] = test.loc[(test['Name'].str.contains('Mr\.')) & test['Fare'] < 10.5 , 'Age'].fillna(mr_t6)
test.loc[test['Name'].str.contains('Dr\.'), 'Age'] = test[test['Name'].str.contains('Dr\.')]['Age'].fillna(mr_t5)
test.loc[test['Name'].str.contains('Ms\.'), 'Age'] = test[test['Name'].str.contains('Ms\.')]['Age'].fillna(miss_age)

In [24]:
train.loc[train.Embarked == 'C', 'Embarked'] = 0
train.loc[train.Embarked == 'Q', 'Embarked'] = 1
train.loc[train.Embarked == 'S', 'Embarked'] = 2
train['Embarked'] = train['Embarked'].astype('int64')

test.loc[test.Embarked == 'C', 'Embarked'] = 0
test.loc[test.Embarked == 'Q', 'Embarked'] = 1
test.loc[test.Embarked == 'S', 'Embarked'] = 2
test['Embarked'] = test['Embarked'].astype('int64')

In [25]:
# train.corr()

In [26]:
# filling the missing data in test 
test.isnull().sum()

Name             0
PassengerId      0
Pclass           0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [27]:
test[test['Fare'].isnull()]

,Name,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
152,"Storey, Mr. Thomas",1044,3,0,60.5,0,0,3701,NaN,NaN,2

In [28]:
fare = pd.DataFrame(test[test['Pclass']==3]['Fare'].value_counts().nlargest(12))
fare = fare.reset_index()
fare

      index  Fare
0    7.7500    21
1    8.0500    17
2    7.8958    11
3    7.7750    10
4    7.2292     9
5    7.2250     9
6    8.6625     8
7    7.8542     8
8    7.8792     6
9    7.2500     5
10   7.9250     5
11  15.2458     4

In [29]:
fare['index'].mean()

8.395141666666666

In [30]:
train['Fare'] = train['Fare'].fillna("7.753825")
test['Fare'] = test['Fare'].fillna("7.753825")

In [31]:
train.isnull().sum()
test.isnull().sum()

Name             0
PassengerId      0
Pclass           0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

In [32]:
train['Name'].str.contains('Miss\.')

0      False
1      False
2       True
3      False
4      False
       ...
886    False
887     True
888     True
889    False
890    False
Name: Name, Length: 891, dtype: bool

In [33]:
train.loc[train['Name'].str.contains('Miss\.'), 'Age'] = train[train['Name'].str.contains('Miss\.')]['Age'].fillna(miss_age)
# train.loc[train['Name'].str.contains('Mr\.'), 'Age'] = train[train['Name'].str.contains('Mr\.')]['Age'].fillna(mr_age)
train.loc[train['Name'].str.contains('Mrs\.'), 'Age'] = train[train['Name'].str.contains('Mrs\.')]['Age'].fillna(mrs_age)
train.loc[train['Name'].str.contains('Master\.'), 'Age'] = train[train['Name'].str.contains('Master\.')]['Age'].fillna(master_age)
train.loc[(train['Name'].str.contains('Mrs\.')) & train['Fare'] >= 10.5 , 'Age'] = train.loc[(train['Name'].str.contains('Mrs\.')) & train['Fare'] >= 10.5 , 'Age'].fillna(mr_t5)
train.loc[(train['Name'].str.contains('Mrs\.')) & train['Fare'] < 10.5 , 'Age'] = train.loc[(train['Name'].str.contains('Mrs\.')) & train['Fare'] < 10.5 , 'Age'].fillna(mr_t6)
# train.loc[train['Name'].str.contains('Dr\.'), 'Age'] = train[train['Name'].str.contains('Dr\.')]['Age'].fillna(mr_age)

NameError: name 'mr_age' is not defined

In [ ]:
train

,Name,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Braund, Mr. Owen Harris",1,3,0,22.0,1,0,A/5 21171,7.2500,NaN,2,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",2,1,1,38.0,1,0,PC 17599,71.2833,C85,0,1
2,"Heikkinen, Miss. Laina",3,3,1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2,1
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,35.0,1,0,113803,53.1000,C123,2,1
4,"Allen, Mr. William Henry",5,3,0,35.0,0,0,373450,8.0500,NaN,2,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,"Montvila, Rev. Juozas",887,2,0,27.0,0,0,211536,13.0000,NaN,2,0
887,"Graham, Miss. Margaret Edith",888,1,1,19.0,0,0,112053,30.0000,B42,2,1
888,"Johnston, Miss. Catherine Helen ""Carrie""",889,3,1,21.8,1,2,W./C. 6607,23.4500,NaN,2,0
889,"Behr, Mr. Karl Howell",890,1,0,26.0,0,0,111369,30.0000,C148,0,1
890,"Dooley, Mr. Patrick",891,3,0,32.0,0,0,370376,7.7500,NaN,1,0

## Standard Scaler

In [ ]:
from sklearn.preprocessing import StandardScaler

ss = StandardScaler()
ss.fit(train[['Fare']])
train_fare = ss.transform(train[['Fare']])
test_fare = ss.transform(test[['Fare']])

In [ ]:
train['Fare2'] = train_fare
test['Fare2'] = test_fare

In [ ]:
train.head(3)

,Name,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,Fare2
0,"Braund, Mr. Owen Harris",1,3,0,22.0,1,0,A/5 21171,7.2500,NaN,2,0,-0.502445
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",2,1,1,38.0,1,0,PC 17599,71.2833,C85,0,1,0.786845
2,"Heikkinen, Miss. Laina",3,3,1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2,1,-0.488854

In [34]:
cabin_train = train.loc[train['Cabin'].notnull()]
cabin_test = train.loc[train['Cabin'].isnull()]

In [ ]:
data = train[['Age' ,'Pclass', 'Sex', 'SibSp', 'Parch', 'Embarked', 'Fare2', 'Survived']]
data_test = test[['Age' ,'Pclass', 'Sex', 'SibSp', 'Parch', 'Embarked', 'Fare2']]


X = data.iloc[:,:-1].values
y = data.iloc[:,-1].values

## Splitting the dataset into the Training set and Test set

In [ ]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

## Training the Multiple Linear Regression model on the Training set

In [ ]:
from sklearn.linear_model import LogisticRegression

regressor = LogisticRegression()
regressor.fit(X_train, y_train)

LogisticRegression()

In [ ]:
y_pred = regressor.predict(X_test)
y_pred_test = regressor.predict(data_test)

print(y_pred_test)

# np.set_printoptions(precision=2)
# print(np.concatenate((y_pred.reshape(len(y_pred),1), y_test.reshape(len(y_test),1)),1))

[0 0 0 0 1 0 1 0 1 0 0 0 1 0 1 1 0 0 1 1 0 0 1 1 1 0 1 0 0 0 0 0 0 0 0 0 1
 1 0 0 0 0 0 1 1 0 0 0 1 1 0 0 1 1 0 0 0 0 0 1 0 0 0 1 1 1 1 0 1 1 1 0 1 1
 1 1 0 1 0 1 0 0 0 0 0 0 1 1 1 0 1 0 1 0 1 0 1 0 1 0 1 0 0 0 1 0 0 0 0 0 0
 1 1 1 1 0 0 1 1 1 1 0 1 0 0 1 0 1 0 0 0 0 0 0 0 0 0 0 1 0 0 1 0 0 0 0 1 0
 0 0 1 0 0 1 0 0 1 1 0 1 1 0 1 0 0 1 0 0 1 1 0 0 0 0 0 1 1 0 1 1 0 0 1 0 1
 0 1 0 0 0 0 0 0 0 0 0 1 1 0 1 1 0 0 1 0 1 1 0 1 0 0 0 0 0 0 0 1 0 1 0 1 0
 1 0 1 1 0 1 0 0 0 1 0 0 0 0 0 0 1 1 1 1 0 0 0 0 1 0 1 1 1 0 1 0 0 0 0 0 1
 0 0 0 1 1 0 0 0 0 1 0 0 0 1 1 0 1 0 0 0 0 1 0 1 1 1 0 0 0 0 0 1 1 0 0 0 0
 1 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 1 1 1 0 0 0 0 0 0 0 0 1 0 1 0 0 0 1 0 0
 1 0 0 0 0 0 0 0 0 0 1 0 1 0 1 0 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 1 0 0 1 1 0
 0 1 0 0 1 1 1 0 0 0 0 0 1 1 0 1 0 0 0 0 1 1 0 0 0 1 0 1 0 0 1 0 1 1 0 0 0
 0 1 1 1 1 1 0 1 0 0 0]

c:\Anaconda3\envs\study\lib\site-packages\sklearn\base.py:413: UserWarning: X has feature names, but LogisticRegression was fitted without feature names
  warnings.warn(

## submission

In [ ]:
test

,Name,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare2
0,"Kelly, Mr. James",892,3,0,34.500000,0,0,330911,7.8292,NaN,1,-0.490783
1,"Wilkes, Mrs. James (Ellen Needs)",893,3,1,47.000000,1,0,363272,7.0,NaN,2,-0.507479
2,"Myles, Mr. Thomas Francis",894,2,0,62.000000,0,0,240276,9.6875,NaN,1,-0.453367
3,"Wirz, Mr. Albert",895,3,0,27.000000,0,0,315154,8.6625,NaN,2,-0.474005
4,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",896,3,1,22.000000,1,1,3101298,12.2875,NaN,2,-0.401017
...,...,...,...,...,...,...,...,...,...,...,...,...
413,"Spector, Mr. Woolf",1305,3,0,29.092784,0,0,A.5. 3236,8.05,NaN,2,-0.486337
414,"Oliva y Ocana, Dona. Fermina",1306,1,1,39.000000,0,0,PC 17758,108.9,C105,0,1.544246
415,"Saether, Mr. Simon Sivertsen",1307,3,0,38.500000,0,0,SOTON/O.Q. 3101262,7.25,NaN,2,-0.502445
416,"Ware, Mr. Frederick",1308,3,0,29.092784,0,0,359309,8.05,NaN,2,-0.486337
417,"Peter, Master. Michael J",1309,3,0,4.600000,1,1,2668,22.3583,NaN,0,-0.198244

In [ ]:

submission = pd.DataFrame({
        "PassengerId": test["PassengerId"],
        "Survived": y_pred_test
    })

In [ ]:
submission.to_csv('Submission.csv', index = False)

In [ ]:
test.loc[(test['Name'].str.contains('Mr\.')) & test['Fare'] < 10.5 ]

,Name,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare2
0,"Kelly, Mr. James",892,3,0,34.500000,0,0,330911,7.8292,NaN,1,-0.490783
1,"Wilkes, Mrs. James (Ellen Needs)",893,3,1,47.000000,1,0,363272,7.0,NaN,2,-0.507479
2,"Myles, Mr. Thomas Francis",894,2,0,62.000000,0,0,240276,9.6875,NaN,1,-0.453367
3,"Wirz, Mr. Albert",895,3,0,27.000000,0,0,315154,8.6625,NaN,2,-0.474005
4,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",896,3,1,22.000000,1,1,3101298,12.2875,NaN,2,-0.401017
...,...,...,...,...,...,...,...,...,...,...,...,...
413,"Spector, Mr. Woolf",1305,3,0,29.092784,0,0,A.5. 3236,8.05,NaN,2,-0.486337
414,"Oliva y Ocana, Dona. Fermina",1306,1,1,39.000000,0,0,PC 17758,108.9,C105,0,1.544246
415,"Saether, Mr. Simon Sivertsen",1307,3,0,38.500000,0,0,SOTON/O.Q. 3101262,7.25,NaN,2,-0.502445
416,"Ware, Mr. Frederick",1308,3,0,29.092784,0,0,359309,8.05,NaN,2,-0.486337
417,"Peter, Master. Michael J",1309,3,0,4.600000,1,1,2668,22.3583,NaN,0,-0.198244